PatientCohortService/src/conf/xml-resources/web-service-references/AdapterFactService/wsdl/nhinint03.asu.edu_8080/CommonDataLayerFactService/AdapterFactService.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.6-hudson-317-. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.6-hudson-317-. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="urn:gov:hhs:fha:nhinc:adapter:factservice" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="urn:gov:hhs:fha:nhinc:adapter:factservice" name="CommonDataLayerFactService">
<ns1:Policy xmlns:ns1="http://www.w3.org/ns/ws-policy" wsu:Id="CommonDataLayerFactPortBinding_GetDemographicsFact_WSAT_Policy">
<ns1:ExactlyOne>
<ns1:All>
<ns2:ATAlwaysCapability xmlns:ns2="http://schemas.xmlsoap.org/ws/2004/10/wsat" />
<ns3:ATAssertion xmlns:ns4="http://schemas.xmlsoap.org/ws/2002/12/policy" xmlns:ns3="http://schemas.xmlsoap.org/ws/2004/10/wsat" ns1:Optional="true" ns4:Optional="true" />
</ns1:All>
</ns1:ExactlyOne>
</ns1:Policy>
<ns5:Policy xmlns:ns5="http://www.w3.org/ns/ws-policy" wsu:Id="CommonDataLayerFactPortBinding_GetAllergyFacts_WSAT_Policy">
<ns5:ExactlyOne>
<ns5:All>
<ns6:ATAlwaysCapability xmlns:ns6="http://schemas.xmlsoap.org/ws/2004/10/wsat" />
<ns7:ATAssertion xmlns:ns8="http://schemas.xmlsoap.org/ws/2002/12/policy" xmlns:ns7="http://schemas.xmlsoap.org/ws/2004/10/wsat" ns5:Optional="true" ns8:Optional="true" />
</ns5:All>
</ns5:ExactlyOne>
</ns5:Policy>
<ns9:Policy xmlns:ns9="http://www.w3.org/ns/ws-policy" wsu:Id="CommonDataLayerFactPortBinding_GetSupportContactFacts_WSAT_Policy">
<ns9:ExactlyOne>
<ns9:All>
<ns10:ATAlwaysCapability xmlns:ns10="http://schemas.xmlsoap.org/ws/2004/10/wsat" />
<ns11:ATAssertion xmlns:ns12="http://schemas.xmlsoap.org/ws/2002/12/policy" xmlns:ns11="http://schemas.xmlsoap.org/ws/2004/10/wsat" ns9:Optional="true" ns12:Optional="true" />
</ns9:All>
</ns9:ExactlyOne>
</ns9:Policy>
<ns13:Policy xmlns:ns13="http://www.w3.org/ns/ws-policy" wsu:Id="CommonDataLayerFactPortBinding_GetTestResultFacts_WSAT_Policy">
<ns13:ExactlyOne>
<ns13:All>
<ns14:ATAlwaysCapability xmlns:ns14="http://schemas.xmlsoap.org/ws/2004/10/wsat" />
<ns15:ATAssertion xmlns:ns16="http://schemas.xmlsoap.org/ws/2002/12/policy" xmlns:ns15="http://schemas.xmlsoap.org/ws/2004/10/wsat" ns13:Optional="true" ns16:Optional="true" />
</ns13:All>
</ns13:ExactlyOne>
</ns13:Policy>
<ns17:Policy xmlns:ns17="http://www.w3.org/ns/ws-policy" wsu:Id="CommonDataLayerFactPortBinding_GetProblemFacts_WSAT_Policy">
<ns17:ExactlyOne>
<ns17:All>
<ns18:ATAlwaysCapability xmlns:ns18="http://schemas.xmlsoap.org/ws/2004/10/wsat" />
<ns19:ATAssertion xmlns:ns20="http://schemas.xmlsoap.org/ws/2002/12/policy" xmlns:ns19="http://schemas.xmlsoap.org/ws/2004/10/wsat" ns17:Optional="true" ns20:Optional="true" />
</ns17:All>
</ns17:ExactlyOne>
</ns17:Policy>
<ns21:Policy xmlns:ns21="http://www.w3.org/ns/ws-policy" wsu:Id="CommonDataLayerFactPortBinding_GetMedicationFacts_WSAT_Policy">
<ns21:ExactlyOne>
<ns21:All>
<ns22:ATAlwaysCapability xmlns:ns22="http://schemas.xmlsoap.org/ws/2004/10/wsat" />
<ns23:ATAssertion xmlns:ns24="http://schemas.xmlsoap.org/ws/2002/12/policy" xmlns:ns23="http://schemas.xmlsoap.org/ws/2004/10/wsat" ns21:Optional="true" ns24:Optional="true" />
</ns21:All>
</ns21:ExactlyOne>
</ns21:Policy>
<types>
<xsd:schema>
<xsd:import namespace="urn:gov:hhs:fha:nhinc:adapter:factservice" schemaLocation="http://nhinint03.asu.edu:8080/CommonDataLayerFactService/AdapterFactService?xsd=1" />
</xsd:schema>
<xsd:schema>
<xsd:import namespace="urn:gov:hhs:fha:nhinc:adapter:fact" schemaLocation="http://nhinint03.asu.edu:8080/CommonDataLayerFactService/AdapterFactService?xsd=2" />
</xsd:schema>
</types>
<message name="GetAllergyFacts">
<part name="parameters" element="tns:GetAllergyFacts" />
</message>
<message name="GetAllergyFactsResponse">
<part name="parameters" element="tns:GetAllergyFactsResponse" />
</message>
<message name="GetProblemFacts">
<part name="parameters" element="tns:GetProblemFacts" />
</message>
<message name="GetProblemFactsResponse">
<part name="parameters" element="tns:GetProblemFactsResponse" />
</message>
<message name="GetDemographicsFact">
<part name="parameters" element="tns:GetDemographicsFact" />
</message>
<message name="GetDemographicsFactResponse">
<part name="parameters" element="tns:GetDemographicsFactResponse" />
</message>
<message name="GetTestResultFacts">
<part name="parameters" element="tns:GetTestResultFacts" />
</message>
<message name="GetTestResultFactsResponse">
<part name="parameters" element="tns:GetTestResultFactsResponse" />
</message>
<message name="GetMedicationFacts">
<part name="parameters" element="tns:GetMedicationFacts" />
</message>
<message name="GetMedicationFactsResponse">
<part name="parameters" element="tns:GetMedicationFactsResponse" />
</message>
<message name="GetSupportContactFacts">
<part name="parameters" element="tns:GetSupportContactFacts" />
</message>
<message name="GetSupportContactFactsResponse">
<part name="parameters" element="tns:GetSupportContactFactsResponse" />
</message>
<portType name="AdapterFactService">
<operation name="GetAllergyFacts">
<input message="tns:GetAllergyFacts" />
<output message="tns:GetAllergyFactsResponse" />
</operation>
<operation name="GetProblemFacts">
<input message="tns:GetProblemFacts" />
<output message="tns:GetProblemFactsResponse" />
</operation>
<operation name="GetDemographicsFact">
<input message="tns:GetDemographicsFact" />
<output message="tns:GetDemographicsFactResponse" />
</operation>
<operation name="GetTestResultFacts">
<input message="tns:GetTestResultFacts" />
<output message="tns:GetTestResultFactsResponse" />
</operation>
<operation name="GetMedicationFacts">
<input message="tns:GetMedicationFacts" />
<output message="tns:GetMedicationFactsResponse" />
</operation>
<operation name="GetSupportContactFacts">
<input message="tns:GetSupportContactFacts" />
<output message="tns:GetSupportContactFactsResponse" />
</operation>
</portType>
<binding name="CommonDataLayerFactPortBinding" type="tns:AdapterFactService">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document" />
<operation name="GetAllergyFacts">
<ns25:PolicyReference xmlns:ns25="http://www.w3.org/ns/ws-policy" URI="#CommonDataLayerFactPortBinding_GetAllergyFacts_WSAT_Policy" />
<soap:operation soapAction="urn:GetAllergyFacts" />
<input>
<soap:body use="literal" />
</input>
<output>
<soap:body use="literal" />
</output>
</operation>
<operation name="GetProblemFacts">
<ns26:PolicyReference xmlns:ns26="http://www.w3.org/ns/ws-policy" URI="#CommonDataLayerFactPortBinding_GetProblemFacts_WSAT_Policy" />
<soap:operation soapAction="urn:GetProblemFacts" />
<input>
<soap:body use="literal" />
</input>
<output>
<soap:body use="literal" />
</output>
</operation>
<operation name="GetDemographicsFact">
<ns27:PolicyReference xmlns:ns27="http://www.w3.org/ns/ws-policy" URI="#CommonDataLayerFactPortBinding_GetDemographicsFact_WSAT_Policy" />
<soap:operation soapAction="urn:GetDemographicsFact" />
<input>
<soap:body use="literal" />
</input>
<output>
<soap:body use="literal" />
</output>
</operation>
<operation name="GetTestResultFacts">
<ns28:PolicyReference xmlns:ns28="http://www.w3.org/ns/ws-policy" URI="#CommonDataLayerFactPortBinding_GetTestResultFacts_WSAT_Policy" />
<soap:operation soapAction="urn:GetTestResultFacts" />
<input>
<soap:body use="literal" />
</input>
<output>
<soap:body use="literal" />
</output>
</operation>
<operation name="GetMedicationFacts">
<ns29:PolicyReference xmlns:ns29="http://www.w3.org/ns/ws-policy" URI="#CommonDataLayerFactPortBinding_GetMedicationFacts_WSAT_Policy" />
<soap:operation soapAction="urn:GetMedicationFacts" />
<input>
<soap:body use="literal" />
</input>
<output>
<soap:body use="literal" />
</output>
</operation>
<operation name="GetSupportContactFacts">
<ns30:PolicyReference xmlns:ns30="http://www.w3.org/ns/ws-policy" URI="#CommonDataLayerFactPortBinding_GetSupportContactFacts_WSAT_Policy" />
<soap:operation soapAction="urn:GetSupportContactFacts" />
<input>
<soap:body use="literal" />
</input>
<output>
<soap:body use="literal" />
</output>
</operation>
</binding>
<service name="CommonDataLayerFactService">
<port name="CommonDataLayerFactPort" binding="tns:CommonDataLayerFactPortBinding">
<soap:address location="http://nhinint03.asu.edu:8080/CommonDataLayerFactService/AdapterFactService" />
</port>
</service>
</definitions>